# Customer Data Part 1

Content List:
1. Import Libraries, Create Path and Import Datasets
2. Wrangle Customer Data
3. Check for Data Consistency
4. Export Updated Dataset

1. Import Libraries, Create Path and Import Datasets

In [13]:
#Import Libraries
import pandas as pd
import numpy as np
import os

In [23]:
#Create Path
path = r'C:\Users\ryanc\OneDrive\Documents\Data Analytics Exercises\Python\Instacart Basket Analysis'

In [24]:
#Import customer data df
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [25]:
#View head of data
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

2. Wrangle Customer Data

In [28]:
#Change name of column 'Surnam' to 'Last Name'
customers.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [29]:
#Check
customers.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [30]:
#Change name of column 'STATE' to 'State'
customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [31]:
#Check
customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [32]:
#View descriptive statistics about the data
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

These descriptive stats all look good and make sense so far

In [38]:
#View more info about date_joined column
customers['date_joined'].value_counts()[customers.date_joined.unique()]

date_joined
1/1/2017     159
1/2/2017     154
1/3/2017     169
1/4/2017     188
1/5/2017     177
            ...
3/28/2020    197
3/29/2020    171
3/30/2020    165
3/31/2020    149
4/1/2020     169
Name: count, Length: 1187, dtype: int64

#Note: I don't see any questions in the project brief requiring info or analysis about the date a customer joined but I'm hesistant to drop it.

#Note: n_dependants isn't the most intuitive name but I also don't want to make it longer by changing it to 
'number_of_dependants' so I'll leave it.

#Viewing the descriptive stats about user_id was helpful to see the min, max and count to ensure the column initially makes sense, however there is no need to perform any statistical analysis on the column and we can change it's type.

In [40]:
#Change 'user_id' column data type
customers['user_id'] = customers['user_id'].astype('str')

In [41]:
#Check
customers['user_id'].dtype

dtype('O')

In [42]:
#Check other data types
customers.dtypes

user_id         object
First Name      object
Last Name       object
Gender          object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

#These data types all look good

3. Check for Data Consistency

In [43]:
#Check for mixed data types
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [44]:
#Change column 'first name' to string data type
customers['First Name'] = customers['First Name'].astype('str')

In [45]:
#Check
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

#No result returned means there is no mixed type data now

In [46]:
#Check for missing values
customers.isnull().sum()

user_id         0
First Name      0
Last Name       0
Gender          0
State           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

#There are no missing values

In [47]:
#Check for duplicate values
df_dups = customers[customers.duplicated()]

In [50]:
#View duplicates
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, n_dependants, fam_status, income]
Index: []

#There are no duplicates

4. Export Updated Dataset

In [52]:
#Export Customer Data
customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers.pkl'))

#Due to memory issues I will be combining the data in a different notebook